tjaekel/MaaXBoard-RT_SPIder/board/pin_mux.c
  GPIO_PinInit(CM7_GPIO3, 24U, &USER_GPIO_config);		//PCS is always output and driven

  USER_GPIO_config.direction = kGPIO_DigitalInput;		//all other are input for now, we change direction on transaction
  GPIO_PinInit(CM7_GPIO3, 23U, &USER_GPIO_config);
  GPIO_PinInit(CM7_GPIO3, 25U, &USER_GPIO_config);
  GPIO_PinInit(CM7_GPIO3, 26U, &USER_GPIO_config);
  GPIO_PinInit(CM7_GPIO3, 27U, &USER_GPIO_config);
  GPIO_PinInit(CM7_GPIO3, 18U, &USER_GPIO_config);
  /* we could also clear the CM7_GPIO3->GDIR register bits */

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_24_GPIO_MUX3_IO23,     /* configured as GPIO - SCLK */
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_24_GPIO_MUX3_IO23,
	  0x03U);

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_25_GPIO_MUX3_IO24,     /* configured as GPIO - PCS0*/
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_25_GPIO_MUX3_IO24,
	  0x03U);

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25,     /* configured as GPIO - D0 */
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25,
	  0x03U);

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_27_GPIO_MUX3_IO26,     /* configured as GPIO - D1 */
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_27_GPIO_MUX3_IO26,
	  0x03U);

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_28_GPIO_MUX3_IO27,     /* configured as GPIO - D2 */
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_28_GPIO_MUX3_IO27,
  	  0x03U);

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_19_GPIO_MUX3_IO18,     /* configured as GPIO - D3 */
      0x0U);

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_AD_19_GPIO_MUX3_IO18,
	  0x03U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMipiPanelPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M17, peripheral: GPIO9, signal: 'gpio_io, 28', pin_signal: GPIO_AD_29, gpio_init_state: no_init, pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: K2, peripheral: LPI2C2, signal: SCL, pin_signal: GPIO_EMC_B2_00, software_input_on: Enable, pdrv_config: no_init, open_drain: Enable}
  - {pin_num: K4, peripheral: LPI2C2, signal: SDA, pin_signal: GPIO_EMC_B2_01, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, pdrv_config: no_init,
    open_drain: Enable}
  - {pin_num: K17, peripheral: GPIO9, signal: 'gpio_io, 29', pin_signal: GPIO_AD_30, gpio_interrupt: no_init, software_input_on: Enable, pull_up_down_config: Pull_Down,
    pull_keeper_select: no_init, drive_strength: Normal}
  - {pin_num: P13, peripheral: GPIO9, signal: 'gpio_io, 04', pin_signal: GPIO_AD_05, gpio_init_state: no_init, pull_up_down_config: Pull_Down, pull_keeper_select: no_init,
    open_drain: Disable, drive_strength: Normal, slew_rate: Slow}
  - {pin_num: M14, peripheral: GPIO9, signal: 'gpio_io, 14', pin_signal: GPIO_AD_15, pull_keeper_select: no_init}
  - {pin_num: R1, peripheral: GPIO8, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B2_03, gpio_init_state: no_init, pull_down_pull_up_config: Pull_Down, pdrv_config: Normal_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMipiPanelPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMipiPanelPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_GPIO9_IO04,           /* GPIO_AD_05 is configured as GPIO9_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_GPIO9_IO14,           /* GPIO_AD_15 is configured as GPIO9_IO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_GPIO9_IO28,           /* GPIO_AD_29 is configured as GPIO9_IO28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_GPIO9_IO29,           /* GPIO_AD_30 is configured as GPIO9_IO29 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_30 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_00_LPI2C2_SCL,       /* GPIO_EMC_B2_00 is configured as LPI2C2_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_01_LPI2C2_SDA,       /* GPIO_EMC_B2_01 is configured as LPI2C2_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_01 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_03_GPIO8_IO13,       /* GPIO_EMC_B2_03 is configured as GPIO8_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_05_GPIO9_IO04,           /* GPIO_AD_05 PAD functional properties : */
      0x04U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_29_GPIO9_IO28,           /* GPIO_AD_29 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_30_GPIO9_IO29,           /* GPIO_AD_30 PAD functional properties : */
      0x04U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_00_LPI2C2_SCL,       /* GPIO_EMC_B2_00 PAD functional properties : */
      0x18U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_01_LPI2C2_SDA,       /* GPIO_EMC_B2_01 PAD functional properties : */
      0x18U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_03_GPIO8_IO13,       /* GPIO_EMC_B2_03 PAD functional properties : */
      0x0AU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


